//*******************************************************************************
//*                   _____   _____   _   _   ___                               *
//*                  |  ___| |  ___| | | | | |   `                              *
//*                  | |_    | |_    | |_| | | [] |                             *
//*                  |  _|   |  _|   |  _  | |  _ <                             *
//*                  | |___  | |___  | | | | | |_| |                            *
//*                  |_____| |_____| |_| |_| |____/                             *
//*                                                                             *
//*  Project:          BIOSControl uPD70Fxxxx                                   *
//*  (c) copyright     Harman-Becker Automotive Systems                         *
//*******************************************************************************

// ------------------------------------------------------------------------------
//  Include files
// ------------------------------------------------------------------------------
#include <string.h>          		   // für memcpy
#include <stdint.h>
#include <stdarg.h>
                                    // voneinander abhaengige includes
                                    // daher Reihenfolge wichtig
#include "cpu_def.h"                // Registerdefinitionen des gewaehlten up
#include "config.h"                 // Schalter fuer Projektspezifische Einstellungen
#include "define.h"                 // global definitions
#include "global.h"                 // globale Datenstrukturen
#include "comm.h"
#include "ints.h"						   // Interruptverwaltung
#include "tool.h"
#include "spi.h"
#include "buffer.h"
#include "timer.h"
#include "ser.h"



// ------------------------------------------------------------------------------
// 	Hauptschalter für das ganze File ab hier
// ------------------------------------------------------------------------------
#if (CP_CSIG0 || CP_CSIG4)


#define  BIT0     (1<<0)
#define  BIT1     (1<<1)
#define  BIT2     (1<<2)
#define  BIT3     (1<<3)
#define  BIT4     (1<<4)
#define  BIT5     (1<<5)
#define  BIT6     (1<<6)
#define  BIT7     (1<<7)
#define  BIT8     (1<<8)
#define  BIT9     (1<<9)
#define  BIT10    (1<<10)
#define  BIT11    (1<<11)
#define  BIT12    (1<<12)
#define  BIT13    (1<<13)
#define  BIT14    (1<<14)
#define  BIT15    (1<<15)
#define  BIT16    (1<<16)
#define  BIT17    (1<<17)
#define  BIT18    (1<<18)

#define  ALL_CS_INAKTIV    BIT7
#define  CS_LEVEL_INAKTIV  BIT6
#define  CS_LEVEL_AKTIV    0


//PMCn is port mode when equal to 0, the data of Pn_m is output to pin Pn_m
#define SPI0_PORT_UNCONFIG    PMC3 &= ~(BIT3 | BIT4 | BIT5 | BIT6 | BIT7);
#define SPI4_PORT_UNCONFIG    PMC25 &= ~(BIT3 | BIT4 | BIT5 | BIT6 | BIT7);


struct SPI_CSIG            // adapted to CISG
{
   UINT8    ctl0;          // 0x00
   UINT8    dummy1;        // 0x01
   UINT8    dummy2;        // 0x02
   UINT8    dummy3;        // 0x03

   UINT32   str0;          // 0x04

   UINT16   stcr0;         // 0x08
   UINT16   dummy4;        // 0x0A

   UINT32   dummy5;        // 0x0C
   UINT32   ctl1;          // 0x10

   UINT16   ctl2;          // 0x14
   UINT16   dummy6;        // 0x16

   UINT8    emu;           // 0x18
   UINT8    dummy7;        // 0x19
   UINT8    dummy8;        // 0x1A
   UINT8    dummy9;        // 0x1B

   UINT32   dummy10;       // 0x1C bis 0x1F
   // -------------------------------------
   UINT8    dummy11[0xFE0];// make up to 0x1000-1

   UINT8    bctl0;         // 0x1000
   UINT8    dummy12;       // 0x1001
   UINT8    dummy13;       // 0x1002
   UINT8    dummy14;       // 0x1003

   UINT32   tx0w;          // 0x1004

   UINT16   tx0h;          // 0x1008
   UINT16   dummy15;       // 0x100A

   UINT16   rx0;           // 0x100C
   UINT16   dummy16;       // 0x100E

   UINT32   cfg0;          // 0x1010
};



//*--------------------------------------------------------------------------*
//* SPI-Message Transceiver possible States                                  *
//*--------------------------------------------------------------------------*

#define SPIMSG_MASTER_DISABLED             0
#define SPIMSG_MASTER_ENABLED   	 		 1
#define SPIMSG_MASTER_TRANSMITTING        2
#define SPIMSG_MASTER_RECEIVED             3
#define SPIMSG_MASTER_ERRORSTATE          4


// ------------------------------------------------------------------------------
//  Local defines
// ------------------------------------------------------------------------------
//#define SER_CH_NUM      15     // höchste Kanalnummer (Kanaele 0 + 4 + 7 CSIG)    // 4 nicht verwendet beim M033
#define MAX_BURST_TRANSFER_SIZE  256


// Prototypes
BOOL     SpiWrite_String_CSIG(UINT8 Channel, UINT8 Number, UINT8* SendData, UINT8* ReceiveData);
